## 빅데이터 분석 리뷰

In [1]:
# 필요 라이브러리 사용등록
import pandas as pd

In [2]:
urlPath = r'https://raw.githubusercontent.com/hugoMGSung/works-need-it-data-analysis/main/bigdata-python-2023/Day06/data/%EC%B6%A9%EC%B2%AD%EB%B6%81%EB%8F%84_%ED%91%B8%EB%93%9C%EB%B1%85%ED%81%AC%ED%98%84%ED%99%A9.csv'

dfCBFoodBank = pd.read_csv(urlPath)
dfCBFoodBank.tail()

,지역,시군구,센터단위,센터구분,지원센터,신고구분,운영단체명,운영법인분류(대),대표자명,센터전화번호,주소,등록일자
24,충북,충청북도 음성군,기초,푸드뱅크,한울사랑나눔,당연신고,한울사랑나눔푸드뱅크,개인 운영,이*경,043-878-4312,음성군 생극면 음성로 1620번길 7,2011-11-25
25,충북,충청북도 음성군,기초,푸드뱅크,관성푸드뱅크,당연신고,개인,개인 운영,유*호,043-877-9457,음성군 삼성면 대성로547번길 12,2014-04-18
26,충북,충청북도 단양군,기초,푸드뱅크,단양군푸드뱅크,임의신고,단양군사회복지협의회,법인 운영,김*학,043-422-1299,"단양군 단양읍 수변로 83, 3층",2022-12-01
27,충북,충청북도 단양군,기초,푸드뱅크,단양나눔과기쁨,당연신고,기독교대한성결교회(단양수정교회),법인 운영,함*용,043-421-3191,단양군 대강면 장림1길 6,2012-04-17
28,충북,충청북도 단양군,기초,푸드마켓,단양군푸드마켓,임의신고,단양군사회복지협의회,법인 운영,김*학,043-422-1700,"단양군 단양읍 중앙1로 29, 1층",2012-06-22

In [3]:
dfCBFoodBank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   지역         29 non-null     object
 1   시군구        29 non-null     object
 2   센터단위       29 non-null     object
 3   센터구분       29 non-null     object
 4   지원센터       29 non-null     object
 5   신고구분       29 non-null     object
 6   운영단체명      29 non-null     object
 7   운영법인분류(대)  29 non-null     object
 8   대표자명       29 non-null     object
 9   센터전화번호     29 non-null     object
 10  주소         29 non-null     object
 11  등록일자       29 non-null     object
dtypes: object(12)
memory usage: 2.8+ KB

In [4]:
# Pandas 로 샘플데이터 생성
df = pd.DataFrame({
    'float': [1.0],
    'int': [1],
    'datetime': [pd.Timestamp('20240315')],
    'string': ['dummy'],
    'boolean': [False]})
df

   float  int   datetime string  boolean
0    1.0    1 2024-03-15  dummy    False

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   float     1 non-null      float64
 1   int       1 non-null      int64
 2   datetime  1 non-null      datetime64[ns]
 3   string    1 non-null      object
 4   boolean   1 non-null      bool
dtypes: bool(1), datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 165.0+ bytes

In [6]:
df.dtypes

float              float64
int                  int64
datetime    datetime64[ns]
string              object
boolean               bool
dtype: object

In [7]:
df = df.astype({'float': 'float32'})
df = df.astype({'int': 'int32'})

In [8]:
df.dtypes

float              float32
int                  int32
datetime    datetime64[ns]
string              object
boolean               bool
dtype: object

#### Pandas 데이터타입

| dtype        | 설명         |비고|
|--------------|------------|------|
| **float64**  | 실수         |기본값|
| float32,16,8 | 실수         |옵션(float64도 가능)|
| **int64**    | 정수         |기본값|
| int32,16,8   | wjdtn      |옵션|
| datetime64   | 날짜         | |
| **object**   | 문자열 또는 복합형 | |
| bool         | 부울         | |
| category     | 카테고리       | |

In [9]:
# 판다스 카테고리
df = pd.DataFrame({'id': [1, 2, 3, 4, 5, 6],
                   'raw_grade': ['A', 'D', 'B', 'A', 'D', 'E']})

In [10]:
df

   id raw_grade
0   1         A
1   2         D
2   3         B
3   4         A
4   5         D
5   6         E

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   raw_grade  6 non-null      object
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes

In [12]:
# 카테고리 변경
df['grade'] = df['raw_grade'].astype('category')  # category 는 그룹핑해준다.

In [13]:
df

   id raw_grade grade
0   1         A     A
1   2         D     D
2   3         B     B
3   4         A     A
4   5         D     D
5   6         E     E

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   raw_grade  6 non-null      object
 2   grade      6 non-null      category
dtypes: category(1), int64(1), object(1)
memory usage: 438.0+ bytes

In [15]:
df.sort_values(by='grade')

   id raw_grade grade
0   1         A     A
3   4         A     A
2   3         B     B
1   2         D     D
4   5         D     D
5   6         E     E

In [16]:
df.groupby('grade').size()

/var/folders/pq/25bzgj695sx38jrw0bp84jdw0000gn/T/ipykernel_26180/173354052.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('grade').size()

grade
A    2
B    1
D    2
E    1
dtype: int64

In [17]:
df['grade'].cat.rename_categories(['Very Good', 'Good', 'Bad', "Really Bad"])

0     Very Good
1           Bad
2          Good
3     Very Good
4           Bad
5    Really Bad
Name: grade, dtype: category
Categories (4, object): ['Very Good', 'Good', 'Bad', 'Really Bad']

### 전처리 중 결측치/이상치 제거
- kaggle 또는 Seaborn의 타이타닉 생존자 데이터로 결측치/이상치 탐색 후 처리

In [18]:
# 라이브러리 등록
import seaborn as sns

In [19]:
sns.get_dataset_names()[-1]

'titanic'

In [20]:
dfTiatanic = sns.load_dataset(name='titanic')

In [21]:
dfTiatanic.tail()  # 데이터는 891개이다.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [22]:
dfTiatanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

#### 컬럼 설명

|컬럼명| 설명                  |
|---|---------------------|
|survived| 생존여부(1:생존)          |
|pclass| 객실등급(1~3)           |
|sex| 성별(male/femail)     |
|age| 나이                  |
|sibsp| 형제+배우자 수            |
|parch| 부모+자녀 수             |
|fare| 좌석요금                |
|embarked| 탑승항구 약어(S, C, Q)    |
|who| 남자, 여자, 아이          |
|adult_male| 성인남자여부(True, False) |
|deck| 배 내부 데크             |
|embark_town| 탑승항구 이름(Southampton, Cherbourg, Queenstown)|
|alive|생존 여부(Yes/No)|
|alone|1인 탑승여부|

In [23]:
# 복사본 만들기
dfCopy = dfTiatanic.copy()

In [24]:
# 필요컬럼만 가져올떄
dfCopy[['survived', 'age', 'fare']].tail()

     survived   age   fare
886         0  27.0  13.00
887         1  19.0  30.00
888         0   NaN  23.45
889         1  26.0  30.00
890         0  32.0   7.75

In [25]:
# 필요 row만 가져올 때(범위) : 슬라이싱 사용 
dfCopy.loc[0:5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
# 필요 row만 가져올 때(개별로) : 리스트를 한번 더 넣어준다.
dfCopy.loc[[0, 4, 5]]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [27]:
# 필요한 row를 가져올 때 행번호로 선택
dfCopy.iloc[:3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [28]:
# iloc(Index Location): 행과열을 선택하여 가져올 수 있다.
dfCopy.iloc[:,3]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

#### 결측치 검색

In [29]:
dfCopy.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [30]:
# isnull() : 각 셀의 결측치를 출력(True/False)
dfCopy.isnull().sum() # 각 컬럼의 결측치의 합을 출력

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [31]:
# isna()
dfCopy.isna().sum().sum() # 결측치의 총합

869

In [32]:
# 결측치 필터링
dfCopy[dfCopy['age'].isnull()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

#### 결측치를 채워넣는 방법

In [33]:
# fillna() 사용
dfCopy['age'] = dfCopy['age'].fillna(200)

In [34]:
dfCopy

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,200.0,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [35]:
condition = dfCopy['age']==200

# 결측치 검사후 결측치 검색
dfCopy[condition].isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           158
embark_town      0
alive            0
alone            0
dtype: int64